Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/bootloader_serial_flash/firmware/src/packs/ATSAMA5D29_DFP/component/adc.h
/* -------- ADC_ISR : (ADC Offset: 0x30) ( R/ 32) Interrupt Status Register -------- */
#define ADC_ISR_EOC0_Pos                      _UINT32_(0)                                          /* (ADC_ISR) End of Conversion 0 (automatically set / cleared) Position */
#define ADC_ISR_EOC0_Msk                      (_UINT32_(0x1) << ADC_ISR_EOC0_Pos)                  /* (ADC_ISR) End of Conversion 0 (automatically set / cleared) Mask */
#define ADC_ISR_EOC0(value)                   (ADC_ISR_EOC0_Msk & (_UINT32_(value) << ADC_ISR_EOC0_Pos)) /* Assigment of value for EOC0 in the ADC_ISR register */
#define ADC_ISR_EOC1_Pos                      _UINT32_(1)                                          /* (ADC_ISR) End of Conversion 1 (automatically set / cleared) Position */
#define ADC_ISR_EOC1_Msk                      (_UINT32_(0x1) << ADC_ISR_EOC1_Pos)                  /* (ADC_ISR) End of Conversion 1 (automatically set / cleared) Mask */
#define ADC_ISR_EOC1(value)                   (ADC_ISR_EOC1_Msk & (_UINT32_(value) << ADC_ISR_EOC1_Pos)) /* Assigment of value for EOC1 in the ADC_ISR register */
#define ADC_ISR_EOC2_Pos                      _UINT32_(2)                                          /* (ADC_ISR) End of Conversion 2 (automatically set / cleared) Position */
#define ADC_ISR_EOC2_Msk                      (_UINT32_(0x1) << ADC_ISR_EOC2_Pos)                  /* (ADC_ISR) End of Conversion 2 (automatically set / cleared) Mask */
#define ADC_ISR_EOC2(value)                   (ADC_ISR_EOC2_Msk & (_UINT32_(value) << ADC_ISR_EOC2_Pos)) /* Assigment of value for EOC2 in the ADC_ISR register */
#define ADC_ISR_EOC3_Pos                      _UINT32_(3)                                          /* (ADC_ISR) End of Conversion 3 (automatically set / cleared) Position */
#define ADC_ISR_EOC3_Msk                      (_UINT32_(0x1) << ADC_ISR_EOC3_Pos)                  /* (ADC_ISR) End of Conversion 3 (automatically set / cleared) Mask */
#define ADC_ISR_EOC3(value)                   (ADC_ISR_EOC3_Msk & (_UINT32_(value) << ADC_ISR_EOC3_Pos)) /* Assigment of value for EOC3 in the ADC_ISR register */
#define ADC_ISR_EOC4_Pos                      _UINT32_(4)                                          /* (ADC_ISR) End of Conversion 4 (automatically set / cleared) Position */
#define ADC_ISR_EOC4_Msk                      (_UINT32_(0x1) << ADC_ISR_EOC4_Pos)                  /* (ADC_ISR) End of Conversion 4 (automatically set / cleared) Mask */
#define ADC_ISR_EOC4(value)                   (ADC_ISR_EOC4_Msk & (_UINT32_(value) << ADC_ISR_EOC4_Pos)) /* Assigment of value for EOC4 in the ADC_ISR register */
#define ADC_ISR_EOC5_Pos                      _UINT32_(5)                                          /* (ADC_ISR) End of Conversion 5 (automatically set / cleared) Position */
#define ADC_ISR_EOC5_Msk                      (_UINT32_(0x1) << ADC_ISR_EOC5_Pos)                  /* (ADC_ISR) End of Conversion 5 (automatically set / cleared) Mask */
#define ADC_ISR_EOC5(value)                   (ADC_ISR_EOC5_Msk & (_UINT32_(value) << ADC_ISR_EOC5_Pos)) /* Assigment of value for EOC5 in the ADC_ISR register */
#define ADC_ISR_EOC6_Pos                      _UINT32_(6)                                          /* (ADC_ISR) End of Conversion 6 (automatically set / cleared) Position */
#define ADC_ISR_EOC6_Msk                      (_UINT32_(0x1) << ADC_ISR_EOC6_Pos)                  /* (ADC_ISR) End of Conversion 6 (automatically set / cleared) Mask */
#define ADC_ISR_EOC6(value)                   (ADC_ISR_EOC6_Msk & (_UINT32_(value) << ADC_ISR_EOC6_Pos)) /* Assigment of value for EOC6 in the ADC_ISR register */
#define ADC_ISR_EOC7_Pos                      _UINT32_(7)                                          /* (ADC_ISR) End of Conversion 7 (automatically set / cleared) Position */
#define ADC_ISR_EOC7_Msk                      (_UINT32_(0x1) << ADC_ISR_EOC7_Pos)                  /* (ADC_ISR) End of Conversion 7 (automatically set / cleared) Mask */
#define ADC_ISR_EOC7(value)                   (ADC_ISR_EOC7_Msk & (_UINT32_(value) << ADC_ISR_EOC7_Pos)) /* Assigment of value for EOC7 in the ADC_ISR register */
#define ADC_ISR_EOC8_Pos                      _UINT32_(8)                                          /* (ADC_ISR) End of Conversion 8 (automatically set / cleared) Position */
#define ADC_ISR_EOC8_Msk                      (_UINT32_(0x1) << ADC_ISR_EOC8_Pos)                  /* (ADC_ISR) End of Conversion 8 (automatically set / cleared) Mask */
#define ADC_ISR_EOC8(value)                   (ADC_ISR_EOC8_Msk & (_UINT32_(value) << ADC_ISR_EOC8_Pos)) /* Assigment of value for EOC8 in the ADC_ISR register */
#define ADC_ISR_EOC9_Pos                      _UINT32_(9)                                          /* (ADC_ISR) End of Conversion 9 (automatically set / cleared) Position */
#define ADC_ISR_EOC9_Msk                      (_UINT32_(0x1) << ADC_ISR_EOC9_Pos)                  /* (ADC_ISR) End of Conversion 9 (automatically set / cleared) Mask */
#define ADC_ISR_EOC9(value)                   (ADC_ISR_EOC9_Msk & (_UINT32_(value) << ADC_ISR_EOC9_Pos)) /* Assigment of value for EOC9 in the ADC_ISR register */
#define ADC_ISR_EOC10_Pos                     _UINT32_(10)                                         /* (ADC_ISR) End of Conversion 10 (automatically set / cleared) Position */
#define ADC_ISR_EOC10_Msk                     (_UINT32_(0x1) << ADC_ISR_EOC10_Pos)                 /* (ADC_ISR) End of Conversion 10 (automatically set / cleared) Mask */
#define ADC_ISR_EOC10(value)                  (ADC_ISR_EOC10_Msk & (_UINT32_(value) << ADC_ISR_EOC10_Pos)) /* Assigment of value for EOC10 in the ADC_ISR register */
#define ADC_ISR_EOC11_Pos                     _UINT32_(11)                                         /* (ADC_ISR) End of Conversion 11 (automatically set / cleared) Position */
#define ADC_ISR_EOC11_Msk                     (_UINT32_(0x1) << ADC_ISR_EOC11_Pos)                 /* (ADC_ISR) End of Conversion 11 (automatically set / cleared) Mask */
#define ADC_ISR_EOC11(value)                  (ADC_ISR_EOC11_Msk & (_UINT32_(value) << ADC_ISR_EOC11_Pos)) /* Assigment of value for EOC11 in the ADC_ISR register */
#define ADC_ISR_LCCHG_Pos                     _UINT32_(19)                                         /* (ADC_ISR) Last Channel Change (cleared on read) Position */
#define ADC_ISR_LCCHG_Msk                     (_UINT32_(0x1) << ADC_ISR_LCCHG_Pos)                 /* (ADC_ISR) Last Channel Change (cleared on read) Mask */
#define ADC_ISR_LCCHG(value)                  (ADC_ISR_LCCHG_Msk & (_UINT32_(value) << ADC_ISR_LCCHG_Pos)) /* Assigment of value for LCCHG in the ADC_ISR register */
#define ADC_ISR_XRDY_Pos                      _UINT32_(20)                                         /* (ADC_ISR) Touchscreen XPOS Measure Ready (cleared on read) Position */
#define ADC_ISR_XRDY_Msk                      (_UINT32_(0x1) << ADC_ISR_XRDY_Pos)                  /* (ADC_ISR) Touchscreen XPOS Measure Ready (cleared on read) Mask */
#define ADC_ISR_XRDY(value)                   (ADC_ISR_XRDY_Msk & (_UINT32_(value) << ADC_ISR_XRDY_Pos)) /* Assigment of value for XRDY in the ADC_ISR register */
#define ADC_ISR_YRDY_Pos                      _UINT32_(21)                                         /* (ADC_ISR) Touchscreen YPOS Measure Ready (cleared on read) Position */
#define ADC_ISR_YRDY_Msk                      (_UINT32_(0x1) << ADC_ISR_YRDY_Pos)                  /* (ADC_ISR) Touchscreen YPOS Measure Ready (cleared on read) Mask */
#define ADC_ISR_YRDY(value)                   (ADC_ISR_YRDY_Msk & (_UINT32_(value) << ADC_ISR_YRDY_Pos)) /* Assigment of value for YRDY in the ADC_ISR register */
#define ADC_ISR_PRDY_Pos                      _UINT32_(22)                                         /* (ADC_ISR) Touchscreen Pressure Measure Ready (cleared on read) Position */
#define ADC_ISR_PRDY_Msk                      (_UINT32_(0x1) << ADC_ISR_PRDY_Pos)                  /* (ADC_ISR) Touchscreen Pressure Measure Ready (cleared on read) Mask */
#define ADC_ISR_PRDY(value)                   (ADC_ISR_PRDY_Msk & (_UINT32_(value) << ADC_ISR_PRDY_Pos)) /* Assigment of value for PRDY in the ADC_ISR register */
#define ADC_ISR_DRDY_Pos                      _UINT32_(24)                                         /* (ADC_ISR) Data Ready (automatically set / cleared) Position */
#define ADC_ISR_DRDY_Msk                      (_UINT32_(0x1) << ADC_ISR_DRDY_Pos)                  /* (ADC_ISR) Data Ready (automatically set / cleared) Mask */
#define ADC_ISR_DRDY(value)                   (ADC_ISR_DRDY_Msk & (_UINT32_(value) << ADC_ISR_DRDY_Pos)) /* Assigment of value for DRDY in the ADC_ISR register */
#define ADC_ISR_GOVRE_Pos                     _UINT32_(25)                                         /* (ADC_ISR) General Overrun Error (cleared on read) Position */
#define ADC_ISR_GOVRE_Msk                     (_UINT32_(0x1) << ADC_ISR_GOVRE_Pos)                 /* (ADC_ISR) General Overrun Error (cleared on read) Mask */
#define ADC_ISR_GOVRE(value)                  (ADC_ISR_GOVRE_Msk & (_UINT32_(value) << ADC_ISR_GOVRE_Pos)) /* Assigment of value for GOVRE in the ADC_ISR register */
#define ADC_ISR_COMPE_Pos                     _UINT32_(26)                                         /* (ADC_ISR) Comparison Event (cleared on read) Position */
#define ADC_ISR_COMPE_Msk                     (_UINT32_(0x1) << ADC_ISR_COMPE_Pos)                 /* (ADC_ISR) Comparison Event (cleared on read) Mask */
#define ADC_ISR_COMPE(value)                  (ADC_ISR_COMPE_Msk & (_UINT32_(value) << ADC_ISR_COMPE_Pos)) /* Assigment of value for COMPE in the ADC_ISR register */
#define ADC_ISR_PEN_Pos                       _UINT32_(29)                                         /* (ADC_ISR) Pen contact (cleared on read) Position */
#define ADC_ISR_PEN_Msk                       (_UINT32_(0x1) << ADC_ISR_PEN_Pos)                   /* (ADC_ISR) Pen contact (cleared on read) Mask */
#define ADC_ISR_PEN(value)                    (ADC_ISR_PEN_Msk & (_UINT32_(value) << ADC_ISR_PEN_Pos)) /* Assigment of value for PEN in the ADC_ISR register */
#define ADC_ISR_NOPEN_Pos                     _UINT32_(30)                                         /* (ADC_ISR) No Pen Contact (cleared on read) Position */
#define ADC_ISR_NOPEN_Msk                     (_UINT32_(0x1) << ADC_ISR_NOPEN_Pos)                 /* (ADC_ISR) No Pen Contact (cleared on read) Mask */
#define ADC_ISR_NOPEN(value)                  (ADC_ISR_NOPEN_Msk & (_UINT32_(value) << ADC_ISR_NOPEN_Pos)) /* Assigment of value for NOPEN in the ADC_ISR register */
#define ADC_ISR_PENS_Pos                      _UINT32_(31)                                         /* (ADC_ISR) Pen Detect Status Position */
#define ADC_ISR_PENS_Msk                      (_UINT32_(0x1) << ADC_ISR_PENS_Pos)                  /* (ADC_ISR) Pen Detect Status Mask */
#define ADC_ISR_PENS(value)                   (ADC_ISR_PENS_Msk & (_UINT32_(value) << ADC_ISR_PENS_Pos)) /* Assigment of value for PENS in the ADC_ISR register */
#define ADC_ISR_Msk                           _UINT32_(0xE7780FFF)                                 /* (ADC_ISR) Register Mask  */

#define ADC_ISR_EOC_Pos                       _UINT32_(0)                                          /* (ADC_ISR Position) End of Conversion x (automatically set / cleared) */
#define ADC_ISR_EOC_Msk                       (_UINT32_(0xFFF) << ADC_ISR_EOC_Pos)                 /* (ADC_ISR Mask) EOC */
#define ADC_ISR_EOC(value)                    (ADC_ISR_EOC_Msk & (_UINT32_(value) << ADC_ISR_EOC_Pos)) 

