Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/bootloader_serial_flash/firmware/src/packs/ATSAMA5D29_DFP/component/adc.h
/* -------- ADC_TSMR : (ADC Offset: 0xB0) (R/W 32) Touchscreen Mode Register -------- */
#define ADC_TSMR_TSMODE_Pos                   _UINT32_(0)                                          /* (ADC_TSMR) Touchscreen Mode Position */
#define ADC_TSMR_TSMODE_Msk                   (_UINT32_(0x3) << ADC_TSMR_TSMODE_Pos)               /* (ADC_TSMR) Touchscreen Mode Mask */
#define ADC_TSMR_TSMODE(value)                (ADC_TSMR_TSMODE_Msk & (_UINT32_(value) << ADC_TSMR_TSMODE_Pos)) /* Assigment of value for TSMODE in the ADC_TSMR register */
#define   ADC_TSMR_TSMODE_NONE_Val            _UINT32_(0x0)                                        /* (ADC_TSMR) No Touchscreen  */
#define   ADC_TSMR_TSMODE_4_WIRE_NO_PM_Val    _UINT32_(0x1)                                        /* (ADC_TSMR) 4-wire Touchscreen without pressure measurement  */
#define   ADC_TSMR_TSMODE_4_WIRE_Val          _UINT32_(0x2)                                        /* (ADC_TSMR) 4-wire Touchscreen with pressure measurement  */
#define   ADC_TSMR_TSMODE_5_WIRE_Val          _UINT32_(0x3)                                        /* (ADC_TSMR) 5-wire Touchscreen  */
#define ADC_TSMR_TSMODE_NONE                  (ADC_TSMR_TSMODE_NONE_Val << ADC_TSMR_TSMODE_Pos)    /* (ADC_TSMR) No Touchscreen Position  */
#define ADC_TSMR_TSMODE_4_WIRE_NO_PM          (ADC_TSMR_TSMODE_4_WIRE_NO_PM_Val << ADC_TSMR_TSMODE_Pos) /* (ADC_TSMR) 4-wire Touchscreen without pressure measurement Position  */
#define ADC_TSMR_TSMODE_4_WIRE                (ADC_TSMR_TSMODE_4_WIRE_Val << ADC_TSMR_TSMODE_Pos)  /* (ADC_TSMR) 4-wire Touchscreen with pressure measurement Position  */
#define ADC_TSMR_TSMODE_5_WIRE                (ADC_TSMR_TSMODE_5_WIRE_Val << ADC_TSMR_TSMODE_Pos)  /* (ADC_TSMR) 5-wire Touchscreen Position  */
#define ADC_TSMR_TSAV_Pos                     _UINT32_(4)                                          /* (ADC_TSMR) Touchscreen Average Position */
#define ADC_TSMR_TSAV_Msk                     (_UINT32_(0x3) << ADC_TSMR_TSAV_Pos)                 /* (ADC_TSMR) Touchscreen Average Mask */
#define ADC_TSMR_TSAV(value)                  (ADC_TSMR_TSAV_Msk & (_UINT32_(value) << ADC_TSMR_TSAV_Pos)) /* Assigment of value for TSAV in the ADC_TSMR register */
#define   ADC_TSMR_TSAV_NO_FILTER_Val         _UINT32_(0x0)                                        /* (ADC_TSMR) No Filtering. Only one ADC conversion per measure  */
#define   ADC_TSMR_TSAV_AVG2CONV_Val          _UINT32_(0x1)                                        /* (ADC_TSMR) Averages 2 ADC conversions  */
#define   ADC_TSMR_TSAV_AVG4CONV_Val          _UINT32_(0x2)                                        /* (ADC_TSMR) Averages 4 ADC conversions  */
#define   ADC_TSMR_TSAV_AVG8CONV_Val          _UINT32_(0x3)                                        /* (ADC_TSMR) Averages 8 ADC conversions  */
#define ADC_TSMR_TSAV_NO_FILTER               (ADC_TSMR_TSAV_NO_FILTER_Val << ADC_TSMR_TSAV_Pos)   /* (ADC_TSMR) No Filtering. Only one ADC conversion per measure Position  */
#define ADC_TSMR_TSAV_AVG2CONV                (ADC_TSMR_TSAV_AVG2CONV_Val << ADC_TSMR_TSAV_Pos)    /* (ADC_TSMR) Averages 2 ADC conversions Position  */
#define ADC_TSMR_TSAV_AVG4CONV                (ADC_TSMR_TSAV_AVG4CONV_Val << ADC_TSMR_TSAV_Pos)    /* (ADC_TSMR) Averages 4 ADC conversions Position  */
#define ADC_TSMR_TSAV_AVG8CONV                (ADC_TSMR_TSAV_AVG8CONV_Val << ADC_TSMR_TSAV_Pos)    /* (ADC_TSMR) Averages 8 ADC conversions Position  */
#define ADC_TSMR_TSFREQ_Pos                   _UINT32_(8)                                          /* (ADC_TSMR) Touchscreen Frequency Position */
#define ADC_TSMR_TSFREQ_Msk                   (_UINT32_(0xF) << ADC_TSMR_TSFREQ_Pos)               /* (ADC_TSMR) Touchscreen Frequency Mask */
#define ADC_TSMR_TSFREQ(value)                (ADC_TSMR_TSFREQ_Msk & (_UINT32_(value) << ADC_TSMR_TSFREQ_Pos)) /* Assigment of value for TSFREQ in the ADC_TSMR register */
#define ADC_TSMR_TSSCTIM_Pos                  _UINT32_(16)                                         /* (ADC_TSMR) Touchscreen Switches Closure Time Position */
#define ADC_TSMR_TSSCTIM_Msk                  (_UINT32_(0xF) << ADC_TSMR_TSSCTIM_Pos)              /* (ADC_TSMR) Touchscreen Switches Closure Time Mask */
#define ADC_TSMR_TSSCTIM(value)               (ADC_TSMR_TSSCTIM_Msk & (_UINT32_(value) << ADC_TSMR_TSSCTIM_Pos)) /* Assigment of value for TSSCTIM in the ADC_TSMR register */
#define ADC_TSMR_NOTSDMA_Pos                  _UINT32_(22)                                         /* (ADC_TSMR) No TouchScreen DMA Position */
#define ADC_TSMR_NOTSDMA_Msk                  (_UINT32_(0x1) << ADC_TSMR_NOTSDMA_Pos)              /* (ADC_TSMR) No TouchScreen DMA Mask */
#define ADC_TSMR_NOTSDMA(value)               (ADC_TSMR_NOTSDMA_Msk & (_UINT32_(value) << ADC_TSMR_NOTSDMA_Pos)) /* Assigment of value for NOTSDMA in the ADC_TSMR register */
#define ADC_TSMR_PENDET_Pos                   _UINT32_(24)                                         /* (ADC_TSMR) Pen Contact Detection Enable Position */
#define ADC_TSMR_PENDET_Msk                   (_UINT32_(0x1) << ADC_TSMR_PENDET_Pos)               /* (ADC_TSMR) Pen Contact Detection Enable Mask */
#define ADC_TSMR_PENDET(value)                (ADC_TSMR_PENDET_Msk & (_UINT32_(value) << ADC_TSMR_PENDET_Pos)) /* Assigment of value for PENDET in the ADC_TSMR register */
#define ADC_TSMR_PENDBC_Pos                   _UINT32_(28)                                         /* (ADC_TSMR) Pen Detect Debouncing Period Position */
#define ADC_TSMR_PENDBC_Msk                   (_UINT32_(0xF) << ADC_TSMR_PENDBC_Pos)               /* (ADC_TSMR) Pen Detect Debouncing Period Mask */
#define ADC_TSMR_PENDBC(value)                (ADC_TSMR_PENDBC_Msk & (_UINT32_(value) << ADC_TSMR_PENDBC_Pos)) /* Assigment of value for PENDBC in the ADC_TSMR register */
#define ADC_TSMR_Msk                          _UINT32_(0xF14F0F33)                                 /* (ADC_TSMR) Register Mask  */


/* -------- ADC_XPOSR : (ADC Offset: 0xB4) ( R/ 32) Touchscreen X Position Register -------- */
#define ADC_XPOSR_XPOS_Pos                    _UINT32_(0)                                          /* (ADC_XPOSR) X Position Position */
#define ADC_XPOSR_XPOS_Msk                    (_UINT32_(0xFFF) << ADC_XPOSR_XPOS_Pos)              /* (ADC_XPOSR) X Position Mask */
#define ADC_XPOSR_XPOS(value)                 (ADC_XPOSR_XPOS_Msk & (_UINT32_(value) << ADC_XPOSR_XPOS_Pos)) /* Assigment of value for XPOS in the ADC_XPOSR register */
#define ADC_XPOSR_XSCALE_Pos                  _UINT32_(16)                                         /* (ADC_XPOSR) Scale of XPOS Position */
#define ADC_XPOSR_XSCALE_Msk                  (_UINT32_(0xFFF) << ADC_XPOSR_XSCALE_Pos)            /* (ADC_XPOSR) Scale of XPOS Mask */
#define ADC_XPOSR_XSCALE(value)               (ADC_XPOSR_XSCALE_Msk & (_UINT32_(value) << ADC_XPOSR_XSCALE_Pos)) /* Assigment of value for XSCALE in the ADC_XPOSR register */
#define ADC_XPOSR_Msk                         _UINT32_(0x0FFF0FFF)                                 /* (ADC_XPOSR) Register Mask  */


