Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/bootloader_serial_flash/firmware/src/packs/ATSAMA5D29_DFP/component/adc.h
/* -------- ADC_TSCVR : (ADC Offset: 0xDC) (R/W 32) Touchscreen Correction Values Register -------- */
#define ADC_TSCVR_TSOFFSETCORR_Pos            _UINT32_(0)                                          /* (ADC_TSCVR) Touchscreen Offset Correction Position */
#define ADC_TSCVR_TSOFFSETCORR_Msk            (_UINT32_(0xFFFF) << ADC_TSCVR_TSOFFSETCORR_Pos)     /* (ADC_TSCVR) Touchscreen Offset Correction Mask */
#define ADC_TSCVR_TSOFFSETCORR(value)         (ADC_TSCVR_TSOFFSETCORR_Msk & (_UINT32_(value) << ADC_TSCVR_TSOFFSETCORR_Pos)) /* Assigment of value for TSOFFSETCORR in the ADC_TSCVR register */
#define ADC_TSCVR_TSGAINCORR_Pos              _UINT32_(16)                                         /* (ADC_TSCVR) Touchscreen Gain Correction Position */
#define ADC_TSCVR_TSGAINCORR_Msk              (_UINT32_(0xFFFF) << ADC_TSCVR_TSGAINCORR_Pos)       /* (ADC_TSCVR) Touchscreen Gain Correction Mask */
#define ADC_TSCVR_TSGAINCORR(value)           (ADC_TSCVR_TSGAINCORR_Msk & (_UINT32_(value) << ADC_TSCVR_TSGAINCORR_Pos)) /* Assigment of value for TSGAINCORR in the ADC_TSCVR register */
#define ADC_TSCVR_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (ADC_TSCVR) Register Mask  */


/* -------- ADC_WPMR : (ADC Offset: 0xE4) (R/W 32) Write Protection Mode Register -------- */
#define ADC_WPMR_WPEN_Pos                     _UINT32_(0)                                          /* (ADC_WPMR) Write Protection Enable Position */
#define ADC_WPMR_WPEN_Msk                     (_UINT32_(0x1) << ADC_WPMR_WPEN_Pos)                 /* (ADC_WPMR) Write Protection Enable Mask */
#define ADC_WPMR_WPEN(value)                  (ADC_WPMR_WPEN_Msk & (_UINT32_(value) << ADC_WPMR_WPEN_Pos)) /* Assigment of value for WPEN in the ADC_WPMR register */
#define ADC_WPMR_WPKEY_Pos                    _UINT32_(8)                                          /* (ADC_WPMR) Write Protection Key Position */
#define ADC_WPMR_WPKEY_Msk                    (_UINT32_(0xFFFFFF) << ADC_WPMR_WPKEY_Pos)           /* (ADC_WPMR) Write Protection Key Mask */
#define ADC_WPMR_WPKEY(value)                 (ADC_WPMR_WPKEY_Msk & (_UINT32_(value) << ADC_WPMR_WPKEY_Pos)) /* Assigment of value for WPKEY in the ADC_WPMR register */
#define   ADC_WPMR_WPKEY_PASSWD_Val           _UINT32_(0x414443)                                   /* (ADC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0  */
#define ADC_WPMR_WPKEY_PASSWD                 (ADC_WPMR_WPKEY_PASSWD_Val << ADC_WPMR_WPKEY_Pos)    /* (ADC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0 Position  */
#define ADC_WPMR_Msk                          _UINT32_(0xFFFFFF01)                                 /* (ADC_WPMR) Register Mask  */


/* -------- ADC_WPSR : (ADC Offset: 0xE8) ( R/ 32) Write Protection Status Register -------- */
#define ADC_WPSR_WPVS_Pos                     _UINT32_(0)                                          /* (ADC_WPSR) Write Protection Violation Status Position */
#define ADC_WPSR_WPVS_Msk                     (_UINT32_(0x1) << ADC_WPSR_WPVS_Pos)                 /* (ADC_WPSR) Write Protection Violation Status Mask */
#define ADC_WPSR_WPVS(value)                  (ADC_WPSR_WPVS_Msk & (_UINT32_(value) << ADC_WPSR_WPVS_Pos)) /* Assigment of value for WPVS in the ADC_WPSR register */
#define ADC_WPSR_WPVSRC_Pos                   _UINT32_(8)                                          /* (ADC_WPSR) Write Protection Violation Source Position */
#define ADC_WPSR_WPVSRC_Msk                   (_UINT32_(0xFFFF) << ADC_WPSR_WPVSRC_Pos)            /* (ADC_WPSR) Write Protection Violation Source Mask */
#define ADC_WPSR_WPVSRC(value)                (ADC_WPSR_WPVSRC_Msk & (_UINT32_(value) << ADC_WPSR_WPVSRC_Pos)) /* Assigment of value for WPVSRC in the ADC_WPSR register */
#define ADC_WPSR_Msk                          _UINT32_(0x00FFFF01)                                 /* (ADC_WPSR) Register Mask  */


/** \brief ADC register offsets definitions */
#define ADC_CR_REG_OFST                _UINT32_(0x00)      /* (ADC_CR) Control Register Offset */
#define ADC_MR_REG_OFST                _UINT32_(0x04)      /* (ADC_MR) Mode Register Offset */
#define ADC_SEQR1_REG_OFST             _UINT32_(0x08)      /* (ADC_SEQR1) Channel Sequence Register 1 Offset */
#define ADC_SEQR2_REG_OFST             _UINT32_(0x0C)      /* (ADC_SEQR2) Channel Sequence Register 2 Offset */
#define ADC_CHER_REG_OFST              _UINT32_(0x10)      /* (ADC_CHER) Channel Enable Register Offset */
#define ADC_CHDR_REG_OFST              _UINT32_(0x14)      /* (ADC_CHDR) Channel Disable Register Offset */
#define ADC_CHSR_REG_OFST              _UINT32_(0x18)      /* (ADC_CHSR) Channel Status Register Offset */
#define ADC_LCDR_REG_OFST              _UINT32_(0x20)      /* (ADC_LCDR) Last Converted Data Register Offset */
#define ADC_IER_REG_OFST               _UINT32_(0x24)      /* (ADC_IER) Interrupt Enable Register Offset */
#define ADC_IDR_REG_OFST               _UINT32_(0x28)      /* (ADC_IDR) Interrupt Disable Register Offset */
#define ADC_IMR_REG_OFST               _UINT32_(0x2C)      /* (ADC_IMR) Interrupt Mask Register Offset */
#define ADC_ISR_REG_OFST               _UINT32_(0x30)      /* (ADC_ISR) Interrupt Status Register Offset */
#define ADC_LCTMR_REG_OFST             _UINT32_(0x34)      /* (ADC_LCTMR) Last Channel Trigger Mode Register Offset */
#define ADC_LCCWR_REG_OFST             _UINT32_(0x38)      /* (ADC_LCCWR) Last Channel Compare Window Register Offset */
#define ADC_OVER_REG_OFST              _UINT32_(0x3C)      /* (ADC_OVER) Overrun Status Register Offset */
#define ADC_EMR_REG_OFST               _UINT32_(0x40)      /* (ADC_EMR) Extended Mode Register Offset */
#define ADC_CWR_REG_OFST               _UINT32_(0x44)      /* (ADC_CWR) Compare Window Register Offset */
#define ADC_COR_REG_OFST               _UINT32_(0x4C)      /* (ADC_COR) Channel Offset Register Offset */
#define ADC_CDR_REG_OFST               _UINT32_(0x50)      /* (ADC_CDR) Channel Data Register Offset */
#define ADC_CDR0_REG_OFST              _UINT32_(0x50)      /* (ADC_CDR0) Channel Data Register Offset */
#define ADC_CDR1_REG_OFST              _UINT32_(0x54)      /* (ADC_CDR1) Channel Data Register Offset */
#define ADC_CDR2_REG_OFST              _UINT32_(0x58)      /* (ADC_CDR2) Channel Data Register Offset */
#define ADC_CDR3_REG_OFST              _UINT32_(0x5C)      /* (ADC_CDR3) Channel Data Register Offset */
#define ADC_CDR4_REG_OFST              _UINT32_(0x60)      /* (ADC_CDR4) Channel Data Register Offset */
#define ADC_CDR5_REG_OFST              _UINT32_(0x64)      /* (ADC_CDR5) Channel Data Register Offset */
#define ADC_CDR6_REG_OFST              _UINT32_(0x68)      /* (ADC_CDR6) Channel Data Register Offset */
#define ADC_CDR7_REG_OFST              _UINT32_(0x6C)      /* (ADC_CDR7) Channel Data Register Offset */
#define ADC_CDR8_REG_OFST              _UINT32_(0x70)      /* (ADC_CDR8) Channel Data Register Offset */
#define ADC_CDR9_REG_OFST              _UINT32_(0x74)      /* (ADC_CDR9) Channel Data Register Offset */
#define ADC_CDR10_REG_OFST             _UINT32_(0x78)      /* (ADC_CDR10) Channel Data Register Offset */
#define ADC_CDR11_REG_OFST             _UINT32_(0x7C)      /* (ADC_CDR11) Channel Data Register Offset */
#define ADC_ACR_REG_OFST               _UINT32_(0x94)      /* (ADC_ACR) Analog Control Register Offset */
#define ADC_TSMR_REG_OFST              _UINT32_(0xB0)      /* (ADC_TSMR) Touchscreen Mode Register Offset */
#define ADC_XPOSR_REG_OFST             _UINT32_(0xB4)      /* (ADC_XPOSR) Touchscreen X Position Register Offset */
#define ADC_YPOSR_REG_OFST             _UINT32_(0xB8)      /* (ADC_YPOSR) Touchscreen Y Position Register Offset */
#define ADC_PRESSR_REG_OFST            _UINT32_(0xBC)      /* (ADC_PRESSR) Touchscreen Pressure Register Offset */
#define ADC_TRGR_REG_OFST              _UINT32_(0xC0)      /* (ADC_TRGR) Trigger Register Offset */
#define ADC_CVR_REG_OFST               _UINT32_(0xD4)      /* (ADC_CVR) Correction Values Register Offset */
#define ADC_CECR_REG_OFST              _UINT32_(0xD8)      /* (ADC_CECR) Channel Error Correction Register Offset */
#define ADC_TSCVR_REG_OFST             _UINT32_(0xDC)      /* (ADC_TSCVR) Touchscreen Correction Values Register Offset */
#define ADC_WPMR_REG_OFST              _UINT32_(0xE4)      /* (ADC_WPMR) Write Protection Mode Register Offset */
#define ADC_WPSR_REG_OFST              _UINT32_(0xE8)      /* (ADC_WPSR) Write Protection Status Register Offset */

